Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ256MC710.h
#define _C2TR01CON_TXEN1_POSITION                0x0000000F
#define _C2TR01CON_TXEN1_MASK                    0x00008000
#define _C2TR01CON_TXEN1_LENGTH                  0x00000001

#define _C2TR01CON_TX0PRI0_POSITION              0x00000000
#define _C2TR01CON_TX0PRI0_MASK                  0x00000001
#define _C2TR01CON_TX0PRI0_LENGTH                0x00000001

#define _C2TR01CON_TX0PRI1_POSITION              0x00000001
#define _C2TR01CON_TX0PRI1_MASK                  0x00000002
#define _C2TR01CON_TX0PRI1_LENGTH                0x00000001

#define _C2TR01CON_TX1PRI0_POSITION              0x00000008
#define _C2TR01CON_TX1PRI0_MASK                  0x00000100
#define _C2TR01CON_TX1PRI0_LENGTH                0x00000001

#define _C2TR01CON_TX1PRI1_POSITION              0x00000009
#define _C2TR01CON_TX1PRI1_MASK                  0x00000200
#define _C2TR01CON_TX1PRI1_LENGTH                0x00000001

#define _C2RXM0EID_EID0_POSITION                 0x00000000
#define _C2RXM0EID_EID0_MASK                     0x00000001
#define _C2RXM0EID_EID0_LENGTH                   0x00000001

#define _C2RXM0EID_EID1_POSITION                 0x00000001
#define _C2RXM0EID_EID1_MASK                     0x00000002
#define _C2RXM0EID_EID1_LENGTH                   0x00000001

#define _C2RXM0EID_EID2_POSITION                 0x00000002
#define _C2RXM0EID_EID2_MASK                     0x00000004
#define _C2RXM0EID_EID2_LENGTH                   0x00000001

#define _C2RXM0EID_EID3_POSITION                 0x00000003
#define _C2RXM0EID_EID3_MASK                     0x00000008
#define _C2RXM0EID_EID3_LENGTH                   0x00000001

#define _C2RXM0EID_EID4_POSITION                 0x00000004
#define _C2RXM0EID_EID4_MASK                     0x00000010
#define _C2RXM0EID_EID4_LENGTH                   0x00000001

#define _C2RXM0EID_EID5_POSITION                 0x00000005
#define _C2RXM0EID_EID5_MASK                     0x00000020
#define _C2RXM0EID_EID5_LENGTH                   0x00000001

#define _C2RXM0EID_EID6_POSITION                 0x00000006
#define _C2RXM0EID_EID6_MASK                     0x00000040
#define _C2RXM0EID_EID6_LENGTH                   0x00000001

#define _C2RXM0EID_EID7_POSITION                 0x00000007
#define _C2RXM0EID_EID7_MASK                     0x00000080
#define _C2RXM0EID_EID7_LENGTH                   0x00000001

#define _C2RXM0EID_EID8_POSITION                 0x00000008
#define _C2RXM0EID_EID8_MASK                     0x00000100
#define _C2RXM0EID_EID8_LENGTH                   0x00000001

#define _C2RXM0EID_EID9_POSITION                 0x00000009
#define _C2RXM0EID_EID9_MASK                     0x00000200
#define _C2RXM0EID_EID9_LENGTH                   0x00000001

#define _C2RXM0EID_EID10_POSITION                0x0000000A
#define _C2RXM0EID_EID10_MASK                    0x00000400
#define _C2RXM0EID_EID10_LENGTH                  0x00000001

#define _C2RXM0EID_EID11_POSITION                0x0000000B
#define _C2RXM0EID_EID11_MASK                    0x00000800
#define _C2RXM0EID_EID11_LENGTH                  0x00000001

#define _C2RXM0EID_EID12_POSITION                0x0000000C
#define _C2RXM0EID_EID12_MASK                    0x00001000
#define _C2RXM0EID_EID12_LENGTH                  0x00000001

#define _C2RXM0EID_EID13_POSITION                0x0000000D
#define _C2RXM0EID_EID13_MASK                    0x00002000
#define _C2RXM0EID_EID13_LENGTH                  0x00000001

#define _C2RXM0EID_EID14_POSITION                0x0000000E
#define _C2RXM0EID_EID14_MASK                    0x00004000
#define _C2RXM0EID_EID14_LENGTH                  0x00000001

#define _C2RXM0EID_EID15_POSITION                0x0000000F
#define _C2RXM0EID_EID15_MASK                    0x00008000
#define _C2RXM0EID_EID15_LENGTH                  0x00000001

#define _C2RXM0EID_EID_POSITION                  0x00000000
#define _C2RXM0EID_EID_MASK                      0x0000FFFF
#define _C2RXM0EID_EID_LENGTH                    0x00000010

#define _C2TR23CON_TX2PRI_POSITION               0x00000000
#define _C2TR23CON_TX2PRI_MASK                   0x00000003
#define _C2TR23CON_TX2PRI_LENGTH                 0x00000002

#define _C2TR23CON_RTREN2_POSITION               0x00000002
#define _C2TR23CON_RTREN2_MASK                   0x00000004
#define _C2TR23CON_RTREN2_LENGTH                 0x00000001

#define _C2TR23CON_TXREQ2_POSITION               0x00000003
#define _C2TR23CON_TXREQ2_MASK                   0x00000008
#define _C2TR23CON_TXREQ2_LENGTH                 0x00000001

#define _C2TR23CON_TXERR2_POSITION               0x00000004
#define _C2TR23CON_TXERR2_MASK                   0x00000010
#define _C2TR23CON_TXERR2_LENGTH                 0x00000001

#define _C2TR23CON_TXLARB2_POSITION              0x00000005
#define _C2TR23CON_TXLARB2_MASK                  0x00000020
#define _C2TR23CON_TXLARB2_LENGTH                0x00000001

#define _C2TR23CON_TXABT2_POSITION               0x00000006
#define _C2TR23CON_TXABT2_MASK                   0x00000040
#define _C2TR23CON_TXABT2_LENGTH                 0x00000001

#define _C2TR23CON_TXEN2_POSITION                0x00000007
#define _C2TR23CON_TXEN2_MASK                    0x00000080
#define _C2TR23CON_TXEN2_LENGTH                  0x00000001

#define _C2TR23CON_TX3PRI_POSITION               0x00000008
#define _C2TR23CON_TX3PRI_MASK                   0x00000300
#define _C2TR23CON_TX3PRI_LENGTH                 0x00000002

#define _C2TR23CON_RTREN3_POSITION               0x0000000A
#define _C2TR23CON_RTREN3_MASK                   0x00000400
#define _C2TR23CON_RTREN3_LENGTH                 0x00000001

#define _C2TR23CON_TXREQ3_POSITION               0x0000000B
#define _C2TR23CON_TXREQ3_MASK                   0x00000800
#define _C2TR23CON_TXREQ3_LENGTH                 0x00000001

#define _C2TR23CON_TXERR3_POSITION               0x0000000C
#define _C2TR23CON_TXERR3_MASK                   0x00001000
#define _C2TR23CON_TXERR3_LENGTH                 0x00000001

#define _C2TR23CON_TXLARB3_POSITION              0x0000000D
#define _C2TR23CON_TXLARB3_MASK                  0x00002000
#define _C2TR23CON_TXLARB3_LENGTH                0x00000001

#define _C2TR23CON_TXABT3_POSITION               0x0000000E
#define _C2TR23CON_TXABT3_MASK                   0x00004000
#define _C2TR23CON_TXABT3_LENGTH                 0x00000001

